Mackenzie_Radinoff/week_05/day_02/adventure/app/controllers/mountains_controller.rb

  def index
    @mountains = Mountain.all
---
SELECT "mountains".* FROM "mountains"

  def show
    @mountain = Mountain.find params[:id]
---
SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @mountain = Mountain.create mountain_params
---
INSERT INTO "mountains" ("name", "image", "elevation", "location", "easiest_route") VALUES (?, ?, ?, ?, ?)  [["name", "asq"], ["image", ""], ["elevation", ""], ["location", ""], ["easiest_route", ""]]

  def edit
    @mountain = Mountain.find params[:id]
---
SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]